posts/week-2/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Week 2 | gramanas &gt;&gt; blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" id="css_theme" href="../../assets/css/theme.gray.css" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://gramanas.github.io/llvm-devlog/posts/week-2/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Anastasis Grammenos">
<meta property="og:site_name" content="gramanas &gt;&gt; blog">
<meta property="og:title" content="Week 2">
<meta property="og:url" content="https://gramanas.github.io/llvm-devlog/posts/week-2/">
<meta property="og:description" content="This past days I focused on some missing Debug Loc that occurred at store instructions
at the function prologue.



Preserving the scope


Instructions on the function prologue are auto-generated and ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-05-28T18:11:00+03:00">
</head>
<body>
    

    <header id="header" class="header transparent"><div class="container">
            <div class="scroll top">
                <a href="#"><i class="icon-chevron-up icon-large"></i></a>
            </div>

            
    <div class="brand">
        <div class="flip_container">
            <div class="flipper">
                <div class="front">
                    <p><a href="https://gramanas.github.io/llvm-devlog/" title="gramanas &gt;&gt; blog" rel="home">

                        <span id="blog-title">gramanas &gt;&gt; blog</span>
                    </a></p>
                </div>

                <div class="back">
                    <p><a href="https://gramanas.github.io/llvm-devlog/" title="LLVM development log for GSoC 2018" rel="home">
                        <span id="blog-description">LLVM development log for GSoC 2018</span>
                    </a></p>
                </div>			
            </div>
        </div>
    </div>

            
    <nav id="menu" role="navigation"><ul>
<li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../rss.xml">RSS feed</a></li>
    
    
    </ul></nav>
</div>
        <div class="separator clearfix"></div>
    </header><div class="body">
        <div id="main" class="container">
            
    <div class="post">
    
    <h1 class="p-name entry-title" itemprop="headline name">Week 2</h1>

        <div class="meta clearfix">
            <div class="authordate left">
                <time class="timeago" datetime="2018-05-28T18:11:00+03:00">2018/05/28</time>
</div>
            

    <div itemprop="keywords" class="tags right">
        <span class="tags">
            <span class="muted small"> <i class="icon-tag"></i> </span>
        </span>
    </div>

        </div>
        <p>
This past days I focused on some missing Debug Loc that occurred at <code>store</code> instructions
at the function prologue.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Preserving the scope</h2>
<div class="outline-text-2" id="text-1">
<p>
Instructions on the function prologue are auto-generated and do not correspond the "real" code.
Thus the Debug Location can't have a valid line number.
</p>

<p>
But the Debug Location metadata contains scope information as well, witch is useful.
Especially after the passes mix and mash the code to form the optimized module.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Background</h2>
<div class="outline-text-2" id="text-2">
<p>
While investigating the SROA pass for missing DI occurrences, there was a test with a <code>phi</code>
induction that was missing Debug Loc. The problem was then narrowed down to a mem2reg call
from SROA. As it turned out the mem2reg was correctly sourcing the <code>phi</code> debug location
from the combined stores, so the problem had to be that there was to DI present at all.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Proposed Solution</h2>
<div class="outline-text-2" id="text-3">
<p>
Hence this <a href="https://reviews.llvm.org/D47097">patch</a> was posted in phab.
</p>

<p>
There is some talk about whether this change is wanted or not, since the 
DI in the instructions of the function prologue is intended to be missing.
</p>

<p>
Although <code>test1</code> clearly shows a phi with missing debug Loc that after the patch is
applied no longer has this problem. 
</p>
</div>
</div>
        
        <ul class="pager hidden-print">
<li class="previous">
                <a href="../week-1-debugify-each/" rel="prev" title="Week 1: debugify-each">Previous post</a>
            </li>
            <li class="next">
                <a href="../sroa-on-amalgamated-sqlite-source/" rel="next" title="SROA on amalgamated sqlite source">Next post</a>
            </li>
        </ul>
</div>



        </div>
    </div>
    

    <footer class="footer"><div class="container clearfix">
            <div class="social pull-left">
                <ul>
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<a href="../../rss.xml" target="_blank">
                        <li> <i class="icon-rss icon-large"></i> 
                        </li>
                    </a>
                </ul>
</div>
            <div class="copyright pull-right">
                <p>Contents © 2018         <a href="mailto:anastasis.gramm2@gmail.com">Anastasis Grammenos</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
                
            </div>
            
        </div>
    </footer><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
